import streamlit as st
import pandas as pd

st.title("Отчет Себестоимости")

data = {
    "Продукт": ["Приемник Триколор", "MB R1N02", "Сбербокс", "Блоки питания"],
    "Категория": ["Внутренний", "Внутренний", "Внешние", "Вычтех"],
    "Количество": [100420, 56500, 52000, 10100],
    "Цена": [416, 412, 292, 2332]
}

df = pd.DataFrame(data)

r1 = st.slider("Внутренний %", 5, 60, 30)
r2 = st.slider("Внешние %", 5, 60, 30)
r3 = st.slider("Вычтех %", 5, 60, 30)

df["Новая цена"] = df["Цена"] * (1 + df["Категория"].map({"Внутренний": r1/100, "Внешние": r2/100, "Вычтех": r3/100}))
df["Выручка"] = df["Новая цена"] * df["Количество"]

st.write("KPI:")
st.write("Выручка:", df["Выручка"].sum())
st.write("Рентабельность:", round(df["Выручка"].sum()/df["Цена"].sum()*100, 1), "%")

st.write("Таблица:")
st.dataframe(df)